{
    "intents": [
      {
        "tag": "Immigration Records",
        "patterns": [
          "How can I access my own immigration records?",
          "What documents are required to apply for immigration status?",
          "Can I request information about my ancestors' immigration history?",
          "Are immigration records accessible to the public?",
          "How long does it typically take to receive information about my immigration status?",
          "Can immigration documentation be used as proof of citizenship?",
          "What information is typically included in immigration records?",
          "Are there any fees associated with obtaining immigration information?",
          "Can immigration data be used to trace family history or genealogy?",
          "How do I request information about immigration procedures from a specific country?",
          "Can immigration documents be corrected or amended if there are errors?",
          "Are there any restrictions on accessing historical immigration information?",
          "How far back do immigration records typically go?",
          "Where can I get some Immigration records",
          "Get me some Immigration records",
          "Immigration Records are now where?",
          "Immigration Records can be found at what offices?",
          "Can immigration files be used as evidence for legal proceedings?",
          "What happens to immigration documentation when a person becomes a citizen?",
          "Can immigration records be used to track a person's travel history?",
          "Are there any privacy concerns associated with accessing immigration data?",
          "How can I obtain immigration information for research purposes?",
          "Can immigration records be used to determine someone's eligibility for certain benefits or programs?",
          "Are immigration procedures standardized in different countries?",
          "How can I resolve a delay in processing my immigration application?",
          "What options do I have if my visa is about to expire, but my application for an extension is still under review?",
          "I recently got married to a U.S. citizen, but my adjustment of status application is taking longer than expected. What should I do?",
          "My employer-sponsored visa is expiring soon, but my employer hasn't initiated the renewal process. Can I apply for an extension on my own?",
          "I received a Notice to Appear (NTA) from Immigration and Customs Enforcement (ICE). How should I proceed and what are my rights in this situation?",
          "I believe my immigration attorney provided ineffective assistance in my case, leading to negative consequences. What recourse do I have?",
          "I'm facing deportation proceedings. How can I find legal representation to help me fight my case?",
          "My green card application was denied, and I received a Request for Evidence (RFE). How can I strengthen my case and address the concerns raised?",
          "I'm a victim of a crime and have been cooperating with law enforcement. Can I apply for a new visa to remain in the United States?",
          "I entered the United States as a child without proper documentation. Are there any immigration options available to me now that I've grown up?",
          "Can I request immigration records for someone who was adopted or had a change of name after immigrating?",
          "Are there any specific requirements or forms I need to fill out to request immigration records from a particular time period or region?",
          "Can you explain the process for accessing immigration records of individuals who arrived through Angel Island in California?",
          "Can I pull up my collar when I go to my immigration court hearing?",
          "If I win my immigration case, can I become a citizen?",
          "What case was the pioneer court case for immigration laws?",
          "What country is the primary source for immigrants in America?"
        ],
        "responses": [
          "It seems like you are looking for Immigration Records"
        ]       
      },



      {
        "tag": "Travel Records",
        "patterns": [
          "How can I access information about my travel history?",
          "What documents are required to obtain my travel details?",
          "Can I request travel information for past trips?",
          "Are passport records accessible to the public?",
          "How long does it typically take to receive travel information after making a request?",
          "Can travel documentation be used as proof of travel for visa applications?",
          "What information is typically included in travel documentation?",
          "Are there any fees associated with obtaining travel information?",
          "Can travel data be used to trace someone's itinerary or travel patterns?",
          "How do I request information about my previous travels from a specific airline or immigration authority?",
          "Can travel documents be corrected or amended if there are errors?",
          "Are there any restrictions on accessing historical travel information?",
          "How far back do travel records typically go?",
          "Can travel documents be used as evidence for legal or insurance purposes?",
          "What happens to travel documentation after a trip is completed?",
          "Can travel records be used to track a person's entry and exit from a country?",
          "Are there any privacy concerns associated with accessing travel data?",
          "How can I obtain travel information for research or personal purposes?",
          "Can travel records be used to determine eligibility for certain travel-related benefits or programs?",
          "Are travel procedures standardized across different airlines or countries?",
          "How can I access my travel records for international trips I have taken?",
          "What documents or records should I keep to track my travel history for immigration or visa purposes?",
          "Can you provide information on how to obtain a copy of my passport travel history?",
          "I recently discovered an error in my travel records. How can I correct it and ensure accurate documentation of my past trips?",
          "Are there any online portals or databases where I can access my travel records for flights and hotel reservations?",
          "I need to retrieve my travel records for a specific period. What steps should I take to gather this information?",
          "How long does the government or airline typically keep records of my travel history?",
          "Can you guide me on how to access my travel records from a specific airline or travel agency?",
          "I need to provide proof of my travel history for a visa application. What documents or records are typically required?",
          "Are there any restrictions on accessing travel records or information of someone else, such as a family member or friend?",
          "What should I do if I suspect that my travel records have been tampered with or altered?",
          "I recently changed my name. How can I update my travel records to reflect this change?",
          "Can I request a new passport from border control or customs authorities?",
          "I lost my travel itinerary and need a record of my flights for reimbursement purposes. How can I obtain this information?",
          "Are there any specific procedures or forms I need to follow to access my travel records for business travel expenses?",
          "I have misplaced my boarding passes for past flights. Can I still retrieve my travel records without them?",
          "How far back can I typically access my travel records? Are there any limitations on the retrieval of older records?",
          "Can you explain the process of accessing my travel records for cruises or other types of maritime travel?",
          "I suspect that my travel records contain errors or missing information. What should I do to resolve this issue?",
          "How can I access my travel records for trips taken within my own country, such as domestic flights or train journeys?",
          "Are my travel records and documents delicate information?",
          "What era has it been easiest to travel?",
          "What do travel documents typically look like?",
          "Can I get law enforcement to swipe through my travel documents?",
          "What equations can be used to calculate flight routes?",
          "What role does the line of Meridian and other lines of longitude and latitude play in travel?",
          "Can I clean out my travel records?",
          "Should I have my passport in electronic form or hard copy?",
          "How do I withdraw my flight reservation?",
          "How does the TSA clasify travel records?",
          "What is regarded as travel documentation?",
          "Is it better to carry out road trips in econoboxes?",
          "Is it a rumour that American Airlines and Spirit Airlines have monopolies on the flight market?",
          "Does the TSA discriminately suspect people of Middle Eastern descent during flights?",
          "Are airline carriers allowed to squeeze passengers during flights?",
          "What are current airline companies proposing this year?",
          "How does WiFi and multimedia work on airplane flights?",
          "What is the most common form of travel for members of society?",
          "What are the most important features I should look for in a company before taking trips?",
          "What is the genuine cost of the president's airplane?"
        ],
        "responses": [
          "It seems like you are looking for Travel Records"
        ]       
      },



      {
        "tag": "IRS Records",
        "patterns": [
          "How can I access my past tax filings and returns?",
          "What documents are required when obtaining IRS information?",
          "Can I request my tax history from previous years?",
          "Are IRS documents accessible to taxpayers?",
          "How long does it typically take to receive information from the IRS?",
          "Can IRS filings be used as proof of income or deductions?",
          "What information is typically included in tax documents from the IRS?",
          "Are there any fees associated with obtaining IRS information?",
          "Can IRS data be used to analyze personal or business financial trends?",
          "How do I request information from the IRS for a specific tax year?",
          "Can IRS documents be corrected or amended if errors are found?",
          "Are there any restrictions on accessing historical tax information from the IRS?",
          "How far back do IRS tax documents typically go?",
          "Can IRS records be used as evidence in tax-related legal cases?",
          "What happens to tax documents after the IRS processes them?",
          "Can IRS data be used to track a person's tax compliance history?",
          "Are there any privacy concerns associated with accessing IRS information?",
          "How can I obtain IRS information for research or financial planning purposes?",
          "Can IRS documents be used to determine eligibility for certain tax benefits or deductions?",
          "Are tax procedures and regulations consistent across different tax jurisdictions?",
          "How can I obtain copies of my previous tax returns from the IRS?",
          "What should I do if I suspect there are errors in my tax records maintained by the IRS?",
          "Can you guide me through the process of accessing my IRS account online to review my tax records?",
          "I need to request a tax transcript from the IRS. What are the available methods for obtaining it?",
          "What steps should I take if I misplaced or lost important tax documents that I need for my records?",
          "I received a notice from the IRS regarding an audit. How can I access my past records to prepare for the audit?",
          "How long does the IRS keep records of tax filings and related documents?",
          "Can you provide information on how to correct an error or discrepancy in my tax records maintained by the IRS?",
          "I suspect that someone may have fraudulently used my identity for tax purposes. What should I do to address this issue with the IRS?",
          "I need to request an installment agreement with the IRS for my tax debt. What records and documents should I gather for the application process?",
          "Can you explain the process for obtaining a tax lien release from the IRS and what documents may be required?",
          "What are the steps involved in filing a complaint or dispute with the IRS regarding inaccurate or mishandled tax records?",
          "I am self-employed and need access to my past tax records for business purposes. How can I retrieve this information from the IRS?",
          "How long does it typically take for the IRS to process a request for an official letter verifying my tax records?",
          "Can I authorize someone else to access my tax records with the IRS on my behalf? What is the procedure for doing so?",
          "I need to request an extension for filing my tax return. What documentation or information is necessary when submitting the request to the IRS?",
          "What options are available for taxpayers who are unable to pay their tax debt and need to set up a payment plan with the IRS?",
          "I recently moved and need to update my address with the IRS. How can I ensure that my tax records reflect this change?",
          "Can you explain the process for requesting a copy of a tax return transcript from the IRS and how long it usually takes to receive it?",
          "I have outstanding tax obligations from previous years. How can I determine the total amount owed to the IRS and access payment records?",
          "Do tax companies sell my IRS records?",
          "How much do convicted heroin traffickers pay to the IRS?",
          "What does my tax profile make me qualify for?",
          "Can I sell fragments of my tax records to private companies?",
          "I'm getting blackmailed. How can I contact the IRS to help me?",
          "Can members of the LGBT+ community have joint tax filings?",
          "How does the IRS perform research on individuals?",
          "Should I despair when my tax return does not come early?",
          "Should I pack the hard copies of my tax filings when i move states?",
          "What other documents do I need for my tax filings?",
          "How fast does the IRS process my taxes?",
          "Can people steal personal information from my tax records?",
          "What impact does my zipcode extension have on my taxes?",
          "What happens to the IRS if a military coup happens?",
          "Can I make late corrections to my tax documents after I send it?",
          "How does the IRS make calculations on taxes?",
          "Can I still recieve tax returns after if I get convicted on a crime?",
          "Does the IRS regulate the competition between tax filing companies?",
          "Is it difficult to deal with IRS representatives?",
          "Can I defeat charges on tax fraud against the IRS?"
        ],
        "responses": [
          "It seems like you are looking for IRS Records"
        ]       
      },



      {
        "tag": "Medical Records",
        "patterns": [
          "How can I request a copy of my medical history?",
          "What is the process for accessing my personal health information?",
          "Are medical records automatically shared between healthcare providers?",
          "Can I request medical records for a deceased family member?",
          "How long are medical records typically kept by healthcare providers?",
          "Can I obtain medical records for a specific procedure or treatment?",
          "What steps can I take to ensure the privacy and security of my medical records?",
          "Can I request amendments or corrections to my medical records?",
          "How do I authorize the release of my medical records to a third party?",
          "Are medical records accessible online for patients?",
          "Can I obtain my child's medical records as their parent or guardian?",
          "How can I obtain medical records for research purposes?",
          "What information is typically included in medical records?",
          "Are there any fees associated with requesting medical records?",
          "Can I request medical records from a previous healthcare provider if I have changed doctors?",
          "Can medical records be used as evidence in legal cases?",
          "How are electronic medical records protected from unauthorized access?",
          "Can I obtain medical records from a hospital stay or emergency room visit?",
          "Are mental health records treated differently than other medical records?",
          "How long does it take to receive copies of requested medical records?",
          "How can I access my own medical records from a specific healthcare provider or hospital?",
          "What steps should I take to request copies of my medical records for personal records or a second opinion?",
          "Can you guide me on how to obtain my medical records from a previous healthcare facility that has since closed?",
          "How long does it typically take to receive copies of medical records after submitting a request?",
          "Are there any restrictions or requirements for accessing medical records of a deceased family member for genealogical or health history purposes?",
          "I suspect that my medical records contain errors or inaccurate information. What should I do to address this issue?",
          "Can you provide information on how to request medical records from a specialist or a specific department within a hospital?",
          "How can I access my child's medical records if they are under the age of 18?",
          "What should I do if I need to transfer my medical records from one healthcare provider to another?",
          "Can I request medical records from a previous hospitalization or surgery that occurred several years ago?",
          "Are there any privacy concerns or regulations I should be aware of when requesting medical records?",
          "How can I obtain medical records related to a specific diagnosis or treatment for research or educational purposes?",
          "Can you explain the process for accessing mental health or psychiatric records within the medical records system?",
          "I need to provide my medical records for a disability claim. What documentation or information should I gather?",
          "What options do I have if my healthcare provider denies or delays my request for access to my medical records?",
          "Can I authorize someone else, such as a family member or attorney, to access my medical records on my behalf?",
          "How can I request medical records related to a specific test or laboratory result conducted by a healthcare provider?",
          "What are the costs associated with obtaining copies of medical records, and are there any fee waivers or reductions available?",
          "Can I request medical records for medical malpractice or legal purposes? What are the procedures involved?",
          "How far back can I typically access my medical records, and are there any limitations on the retrieval of older records?",
          "Does my medical insurance cover everything?",
          "What legislation does the government have on glass-related injuries?",
          "Does the constitution contain anything relating to medical records?",
          "Can I disagree with the CDC on COVID-19 facts?",
          "Am I able to gain access to records from hospitals and clinics around the country?",
          "Can a presidential decree relating to health records be overturned?",
          "What happens to hospital records in the event of a fire?",
          "Does my tax bracket determine what medical insurance I get put on?",
          "What agency is in charge of vetenarian legislation for animals like dogs and cats?",
          "What is the maximun sentence for individuals and agencies who mishandle medical records?",
          "Are there any public records available relating to burn victims?",
          "Are soft copies of medical records readily available?",
          "How much does it cost to carry out surgeries and other complex medical procedures?",
          "Does the government regulate medical procedures?",
          "Can I request my medical records from both private and public hospitals?",
          "Is there a standardised motif for hospitals in the United States?",
          "Is there a standardised behavioural guide from the government concerning mental illnesses?",
          "Does government activity with medical records gain traction in the Senate?",
          "Can I personally track others' medical records?",
          "What can I do if I hate the way my medical records are handled by a hospital?"
        ],
        "responses": [
          "It seems like you are looking for Medical Records"
        ]       
      },



      {
        "tag": "Personnel Records",
        "patterns": [
          "How can I access my employment history from previous jobs?",
          "What documents are typically included in personnel files?",
          "Can I request a copy of my performance evaluations from my personnel file?",
          "Are personnel records confidential and protected?",
          "How long are personnel records retained by employers?",
          "Can I request personnel records for a former coworker?",
          "What information is included in an employee's personnel file?",
          "Can I request my personnel records if I am no longer employed by the company?",
          "Are personnel records shared with other departments within the company?",
          "Can I request a copy of my salary history from my personnel file?",
          "How do I update my personal information in my personnel records?",
          "Can I request a copy of the company's policies and procedures from my personnel file?",
          "Are personnel records accessible to the human resources department only?",
          "How can I request a copy of my training and certifications from my personnel file?",
          "Can I request disciplinary records from my personnel file?",
          "Are personnel records kept in physical or electronic format?",
          "Can I request my personnel records if I am involved in a legal dispute with the company?",
          "Can personnel records be used as evidence in employment-related legal cases?",
          "How do employers ensure the privacy and security of personnel records?",
          "Can I request personnel records from a previous employer if I have changed jobs?",
          "How can I access my own personnel records from a current or previous employer?",
          "What steps should I take to request copies of my personnel records for personal reference or employment verification?",
          "Can you guide me on how to obtain my personnel records from a previous employer that has since closed or merged?",
          "How long does it typically take to receive copies of personnel records after submitting a request?",
          "Are there any restrictions or privacy concerns I should be aware of when accessing personnel records of a deceased employee?",
          "I suspect that my personnel records contain errors or inaccurate information. What should I do to address this issue?",
          "Can you provide information on how to request specific personnel records, such as performance evaluations or disciplinary records?",
          "How can I access my personnel records if I worked for a government agency or the military?",
          "What should I do if my current employer denies my request to access my personnel records?",
          "Can I request personnel records from a previous employment period that occurred several years ago?",
          "Are there any legal requirements or regulations that employers must follow in maintaining and providing personnel records to employees?",
          "How can I obtain personnel records related to a specific incident, such as a workplace accident or harassment complaint?",
          "Can you explain the process for accessing payroll records or tax-related documents within personnel records?",
          "I need to provide my personnel records for a background check or security clearance. What documentation or information should I gather?",
          "What options do I have if I need to transfer my personnel records from one employer to another?",
          "Can I authorize someone else, such as a lawyer or union representative, to access my personnel records on my behalf?",
          "How can I request personnel records related to benefits, such as retirement plans or healthcare coverage?",
          "What are the costs associated with obtaining copies of personnel records, and are there any fee waivers or reductions available?",
          "Can I request personnel records for legal proceedings, such as employment disputes or workers' compensation claims?",
          "How far back can I typically access my personnel records, and are there any limitations on the retrieval of older records?",
          "Can it be my fault if my company mishandles my personal records?",
          "What can the government do if I am getting abused at work?",
          "Does my company of employment contain accurate information about my family?",
          "Can the government request reocrds from the human resources branch of my company?",
          "Can my workplace monitor my consumer habits?",
          "Does the government have legislation on 401k records from companies?",
          "What historiccal patterns can the government draw from personnel records?",
          "Does the government accept people who have bad experiences at work?",
          "Can I transfer my 401k from one company I worked for to another when I switch jobs?",
          "Can human resources accept requests concerning relationships at the workplace?",
          "Where are my personnel records kept?",
          "Can I personally request for and keep my personnel records?",
          "Is there ever legislation on personnel records?",
          "How much unrest has there been on legislation regarding employee records?",
          "Has there been a decrease in employees switching jobs?",
          "Does the government have someone in charge of workers and their records?",
          "What marks the best way to mark my employment?",
          "What tasks do I have to undertake when I want to request my records from my job?"
        ],
        "responses": [
          "It seems like you are looking for Personnel Records"
        ]       
      },


      
      {
        "tag": "Military Records",
        "patterns": [
          "How can I obtain my military service history?",
          "What documents are required to request military discharge papers?",
          "Can I access military service records of a family member?",
          "How long does it take to receive military service records after making a request?",
          "Can military service records be used for veterans' benefits claims?",
          "How do I request a copy of my military training records?",
          "Are military service records accessible to the public?",
          "Can military service records be used as proof of service for employment purposes?",
          "How can I correct errors in my military service records?",
          "Can I request military medical records for myself or a family member?",
          "Are there any fees associated with obtaining military service records?",
          "How far back do military service records typically go?",
          "Can military service records be used to trace family history or genealogy?",
          "How do I request information about military ranks and awards?",
          "Can military service records be used for retirement or pension claims?",
          "Are military service records kept in physical or electronic format?",
          "Can military service records be used in legal proceedings?",
          "How can I obtain military service records for research purposes?",
          "Can I request military service records from a specific branch of the military?",
          "How do I request information about navy or army deployments or assignments?",
          "How can I obtain historical records or documents related to a specific U.S. military organization, such as the Navy or the Marine Corps?",
          "Can you provide information on the organizational structure and chain of command of the U.S. Army?",
          "What are the eligibility requirements to join a specific branch of the U.S. military, like the Air Force or the Coast Guard?",
          "How can I access personnel records or service records of individuals who have served in the U.S. military?",
          "Can you guide me on how to obtain information about the training programs and academies of the U.S. military, like West Point or the Naval Academy?",
          "Are there any online resources or databases where I can access information about the history and traditions of the U.S. military?",
          "What steps should I take to request military records of a family member or ancestor who served in the U.S. military?",
          "Can you provide information on the various military occupational specialties (MOS) and career paths available within the U.S. military?",
          "How can I learn more about the specific units and deployments of a particular U.S. military organization, such as the Army Rangers or the Navy SEALs?",
          "Are there any restrictions or requirements for accessing classified or sensitive information related to U.S. military organizations?",
          "What should I do if I believe there are errors or discrepancies in my own military records or discharge papers?",
          "Can you explain the process for obtaining medals, awards, or decorations earned by individuals serving in the U.S. military?",
          "How can I access military regulations, manuals, or standard operating procedures (SOPs) of a specific branch of the U.S. military?",
          "What resources are available for veterans seeking support and assistance in navigating benefits and services provided by U.S. military organizations?",
          "Can you provide information on the different ranks and insignia used within the U.S. military?",
          "How can I learn about the research and development programs and technologies used by the U.S. military?",
          "Can you explain the process for accessing military medical records or healthcare services provided by U.S. military organizations?",
          "What are the procedures for requesting records related to military contracts, acquisitions, or procurement processes?",
          "Can you provide information on the policies and procedures regarding military justice and the Uniform Code of Military Justice (UCMJ)?",
          "How can I access information about military installations or bases operated by a specific branch of the U.S. military?",
          "What companies feed the military organisations when they are on tour?",
          "Can I enlist in the military when I am young?",
          "Is there a linmit to the number of records I can request from the military?",
          "Do I have to swear when I join the military?",
          "Is the army or navy a better job than others?",
          "Where has the Air Force, Navy, and Military gone since 2002?",
          "Does the president salute military officials?",
          "How long do I have to spend when I join the military, navy or air force?",
          "Is the special operations squad on the brink of a military organisation?",
          "Can I tap into military firewalls to access military records?",
          "Who has the special security clearance to view miliatry records for all Americans?",
          "Do soldiers sleep in cabins or tents when they are on tour?",
          "How much are military secrets and records worth?",
          "Do military members have a history of stabbing. Search the military records",
          "Did the army, navy, or airforce build any major bulidings?",
          "For how long have the military had video records?",
          "When soldiers get court martialed, how often do they get pardoned?",
          "Can I get some sightseeing trips from military members on their bases?",
          "Who is in charge of the air force, navy, and army military records?",
          "Show me records on military vehicles"
        ],
        "responses": [
          "It seems like you are looking for Military Records"
        ]       
      }
    ]
  }